ninxmeow/Holy80/lib/chibios-contrib/os/common/ext/CMSIS/AT32/AT32F435_7xx/at32f435_7xx.h
/*****************  Bit definition for CRM_AHBLPEN2 register  ***************/
#define CRM_AHBLPEN2_DVPLPEN             (0x1U << 0)
#define CRM_AHBLPEN2_OTGFS1LPEN          (0x1U << 7)
#define CRM_AHBLPEN2_SDIO1LPEN           (0x1U << 15)

/*****************  Bit definition for CRM_AHBLPEN3 register  ***************/
#define CRM_AHBLPEN3_XMCLPEN             (0x1U << 0)
#define CRM_AHBLPEN3_QSPI1LPEN           (0x1U << 1)
#define CRM_AHBLPEN3_QSPI2LPEN           (0x1U << 14)
#define CRM_AHBLPEN3_SDIO2LPEN           (0x1U << 15)

/*****************  Bit definition for CRM_APB1LPEN register  ***************/
#define CRM_APB1LPEN_TMR2LPEN            (0x1U << 0)
#define CRM_APB1LPEN_TMR3LPEN            (0x1U << 1)
#define CRM_APB1LPEN_TMR4LPEN            (0x1U << 2)
#define CRM_APB1LPEN_TMR5LPEN            (0x1U << 3)
#define CRM_APB1LPEN_TMR6LPEN            (0x1U << 4)
#define CRM_APB1LPEN_TMR7LPEN            (0x1U << 5)
#define CRM_APB1LPEN_TMR12LPEN           (0x1U << 6)
#define CRM_APB1LPEN_TMR13LPEN           (0x1U << 7)
#define CRM_APB1LPEN_TMR14LPEN           (0x1U << 8)
#define CRM_APB1LPEN_WWDTLPEN            (0x1U << 11)
#define CRM_APB1LPEN_SPI2LPEN            (0x1U << 14)
#define CRM_APB1LPEN_SPI3LPEN            (0x1U << 15)
#define CRM_APB1LPEN_USART2LPEN          (0x1U << 17)
#define CRM_APB1LPEN_USART3LPEN          (0x1U << 18)
#define CRM_APB1LPEN_UART4LPEN           (0x1U << 19)
#define CRM_APB1LPEN_UART5LPEN           (0x1U << 20)
#define CRM_APB1LPEN_I2C1LPEN            (0x1U << 21)
#define CRM_APB1LPEN_I2C2LPEN            (0x1U << 22)
#define CRM_APB1LPEN_I2C3LPEN            (0x1U << 23)
#define CRM_APB1LPEN_CAN1LPEN            (0x1U << 25)
#define CRM_APB1LPEN_CAN2LPEN            (0x1U << 26)
#define CRM_APB1LPEN_PWCLPEN             (0x1U << 28)
#define CRM_APB1LPEN_DACLPEN             (0x1U << 29)
#define CRM_APB1LPEN_UART7LPEN           (0x1U << 30)
#define CRM_APB1LPEN_UART8LPEN           (0x1U << 31)

/*****************  Bit definition for CRM_APB2LPEN register  ***************/
#define CRM_APB2LPEN_TMR1LPEN            (0x1U << 0)
#define CRM_APB2LPEN_TMR8LPEN            (0x1U << 1)
#define CRM_APB2LPEN_USART1LPEN          (0x1U << 4)
#define CRM_APB2LPEN_USART6LPEN          (0x1U << 5)
#define CRM_APB2LPEN_ADC1LPEN            (0x1U << 8)
#define CRM_APB2LPEN_ADC2LPEN            (0x1U << 9)
#define CRM_APB2LPEN_ADC3LPEN            (0x1U << 10)
#define CRM_APB2LPEN_SPI1LPEN            (0x1U << 12)
#define CRM_APB2LPEN_SPI4LPEN            (0x1U << 13)
#define CRM_APB2LPEN_SCFGLPEN            (0x1U << 14)
#define CRM_APB2LPEN_TMR9LPEN            (0x1U << 16)
#define CRM_APB2LPEN_TMR10LPEN           (0x1U << 17)
#define CRM_APB2LPEN_TMR11LPEN           (0x1U << 18)
#define CRM_APB2LPEN_TMR20LPEN           (0x1U << 20)
#define CRM_APB2LPEN_ACCLPEN             (0x1U << 29)

/******************  Bit definition for CRM_BPDC register  *****************/
#define CRM_BPDC_LEXTEN                  (0x1U << 0)
#define CRM_BPDC_LEXTSTBL                (0x1U << 1)
#define CRM_BPDC_LEXTBYPS                (0x1U << 2)
#define CRM_BPDC_ERTCSEL                 (0x3U << 8)
#define CRM_BPDC_ERTCSEL_LEXT            (0x1U << 8)
#define CRM_BPDC_ERTCSEL_LICK            (0x2U << 8)
#define CRM_BPDC_ERTCSEL_HEXTDIV         (0x3U << 8)
#define CRM_BPDC_ERTCEN                  (0x1U << 15)
#define CRM_BPDC_BPDRST                  (0x1U << 16)

/******************  Bit definition for CRM_CTRLSTS register  **************/
#define CRM_CTRLSTS_LICKEN               (0x1U << 0)
#define CRM_CTRLSTS_LICKSTBL             (0x1U << 1)
#define CRM_CTRLSTS_RSTFC                (0x1U << 24)
#define CRM_CTRLSTS_NRSTF                (0x1U << 26)
#define CRM_CTRLSTS_PORRSTF              (0x1U << 27)
#define CRM_CTRLSTS_SWRSTF               (0x1U << 28)
#define CRM_CTRLSTS_WDTRSTF              (0x1U << 29)
#define CRM_CTRLSTS_WWDTRSTF             (0x1U << 30)
#define CRM_CTRLSTS_LPRSTF               (0x1U << 31)

/******************  Bit definition for CRM_MISC1 register  ****************/
#define CRM_MISC1_HICKDIV                (0x1U << 12)
#define CRM_MISC1_HICK_TO_USB            (0x1U << 13)
#define CRM_MISC1_HICK_TO_SCLK           (0x1U << 14)

/******************  Bit definition for CRM_MISC2 register  ****************/
#define CRM_MISC2_AUTO_STEP_EN           (0x3U << 4)
#define CRM_MISC2_CLK1_TO_TMR            (0x1U << 8)
#define CRM_MISC2_EMAC_PPS_SEL           (0x1U << 9)

/******************  Bit definition for PWC_CTRL register  *****************/
#define PWC_CTRL_PVMEN                   (0x1U << 4)
#define PWC_CTRL_BPWEN                   (0x1U << 8)

/******************  Bit definition for FLASH_STS register  ****************/
#define FLASH_STS_OBF                    (0x1U << 0)
#define FLASH_STS_PRGMERR                (0x1U << 2)
#define FLASH_STS_EPPERR                 (0x1U << 4)
#define FLASH_STS_ODF                    (0x1U << 5)

/******************  Bit definition for FLASH_CTRL register  ***************/
#define FLASH_CTRL_FPRGM                 (0x1U << 0)
#define FLASH_CTRL_SECERS                (0x1U << 1)
#define FLASH_CTRL_BANKERS               (0x1U << 2)
#define FLASH_CTRL_USDPRGM               (0x1U << 4)
#define FLASH_CTRL_USDERS                (0x1U << 5)
#define FLASH_CTRL_ERSTR                 (0x1U << 6)
#define FLASH_CTRL_OPLK                  (0x1U << 7)

/******************  Bit definition for TMR_IDEN register  ****************/
#define TMR_IDEN_OVFIEN                  (0x1U << 0)
#define TMR_IDEN_C1IEN                   (0x1U << 1)
#define TMR_IDEN_C2IEN                   (0x1U << 2)
#define TMR_IDEN_C3IEN                   (0x1U << 3)
#define TMR_IDEN_C4IEN                   (0x1U << 4)
#define TMR_IDEN_HALLIEN                 (0x1U << 5)
#define TMR_IDEN_TIEN                    (0x1U << 6)
#define TMR_IDEN_BRKIEN                  (0x1U << 7)
#define TMR_IDEN_OVFDEN                  (0x1U << 8)
#define TMR_IDEN_C1DEN                   (0x1U << 9)
#define TMR_IDEN_C2DEN                   (0x1U << 10)
#define TMR_IDEN_C3DEN                   (0x1U << 11)
#define TMR_IDEN_C4DEN                   (0x1U << 12)
#define TMR_IDEN_HALLDEN                 (0x1U << 13)
#define TMR_IDEN_TDEN                    (0x1U << 14)

/******************  Bit definition for DMA_CxCTRL register  **************/
#define DMA_CTRL_CHEN                    (0x1U << 0)
#define DMA_CTRL_FDTIEN                  (0x1U << 1)
#define DMA_CTRL_HDTIEN                  (0x1U << 2)
#define DMA_CTRL_DTERRIEN                (0x1U << 3)
#define DMA_CTRL_DTD                     (0x1U << 4)
#define DMA_CTRL_LM                      (0x1U << 5)
#define DMA_CTRL_PINCM                   (0x1U << 6)
#define DMA_CTRL_MINCM                   (0x1U << 7)
#define DMA_CTRL_PWIDTH                  (0x3U << 8)
#define DMA_CTRL_PWIDTH_8BITS            (0x0U << 8)
#define DMA_CTRL_PWIDTH_16BITS           (0x1U << 8)
#define DMA_CTRL_PWIDTH_32BITS           (0x2U << 8)
#define DMA_CTRL_MWIDTH                  (0x3U << 10)
#define DMA_CTRL_MWIDTH_8BITS            (0x0U << 10)
#define DMA_CTRL_MWIDTH_16BITS           (0x1U << 10)
#define DMA_CTRL_MWIDTH_32BITS           (0x2U << 10)
#define DMA_CTRL_CHPL                    (0x3U << 12)
#define DMA_CTRL_CHPL_LOW                (0x0U << 12)
#define DMA_CTRL_CHPL_MID                (0x1U << 12)
#define DMA_CTRL_CHPL_HIGH               (0x2U << 12)
#define DMA_CTRL_CHPL_HIGHEST            (0x3U << 12)
#define DMA_CTRL_M2M                     (0x1U << 14)

/******************  Bit definition for DMA_MUXSEL register  *************/
#define DMA_MUXSEL_TBL_SEL               (0x1U << 0)

/******************  Bit definition for DMA_MUXCxCTRL register  *************/
#define DMA_MUXCTRL_SYNCOVIEN            (0x1U << 8)
#define DMA_MUXCTRL_EVTGEN               (0x1U << 9)
#define DMA_MUXCTRL_SYNCEN               (0x1U << 16)
#define DMA_MUXCTRL_SYNCPOL              (0x3U << 17)
#define DMA_MUXCTRL_SYNCPOL_NONE         (0x0U << 17)
#define DMA_MUXCTRL_SYNCPOL_RISING       (0x1U << 17)
#define DMA_MUXCTRL_SYNCPOL_FALLING      (0x2U << 17)
#define DMA_MUXCTRL_SYNCPOL_BOTH         (0x3U << 17)

/******************  Bit definition for DMA_MUXGxCTRL register  *************/
#define DMA_MUXGCTRL_TRGOVIEN            (0x1U << 8)
#define DMA_MUXGCTRL_GEN                 (0x1U << 16)
#define DMA_MUXGCTRL_GPOL                (0x3U << 17)
#define DMA_MUXGCTRL_GPOL_NONE           (0x0U << 17)
#define DMA_MUXGCTRL_GPOL_RISING         (0x1U << 17)
#define DMA_MUXGCTRL_GPOL_FALLING        (0x2U << 17)
#define DMA_MUXGCTRL_GPOL_BOTH           (0x3U << 17)

/******************  Bit definition for EDMA_SxCTRL register  **************/
#define EDMA_SCTRL_SEN                     (0x1U << 0)
#define EDMA_SCTRL_DMERRIEN                (0x1U << 1)
#define EDMA_SCTRL_DTERRIEN                (0x1U << 2)
#define EDMA_SCTRL_HDTIEN                  (0x1U << 3)
#define EDMA_SCTRL_FDTIEN                  (0x1U << 4)
#define EDMA_SCTRL_PFCTRL                  (0x1U << 5)
#define EDMA_SCTRL_DTD                     (0x3U << 6)
#define EDMA_SCTRL_DTD_P2M                 (0x0U << 6)
#define EDMA_SCTRL_DTD_M2P                 (0x1U << 6)
#define EDMA_SCTRL_DTD_M2M                 (0x2U << 6)
#define EDMA_SCTRL_LM                      (0x1U << 8)
#define EDMA_SCTRL_PINCM                   (0x1U << 9)
#define EDMA_SCTRL_MINCM                   (0x1U << 10)
#define EDMA_SCTRL_PWIDTH                  (0x3U << 11)
#define EDMA_SCTRL_PWIDTH_8BITS            (0x0U << 11)
#define EDMA_SCTRL_PWIDTH_16BITS           (0x1U << 11)
#define EDMA_SCTRL_PWIDTH_32BITS           (0x2U << 11)
#define EDMA_SCTRL_MWIDTH                  (0x3U << 13)
#define EDMA_SCTRL_MWIDTH_8BITS            (0x0U << 13)
#define EDMA_SCTRL_MWIDTH_16BITS           (0x1U << 13)
#define EDMA_SCTRL_MWIDTH_32BITS           (0x2U << 13)
#define EDMA_SCTRL_PINCOS                  (0x1U << 15)
#define EDMA_SCTRL_SPL                     (0x3U << 16)
#define EDMA_SCTRL_SPL_LOW                 (0x0U << 16)
#define EDMA_SCTRL_SPL_MID                 (0x1U << 16)
#define EDMA_SCTRL_SPL_HIGH                (0x2U << 16)
#define EDMA_SCTRL_SPL_HIGHEST             (0x3U << 16)
#define EDMA_SCTRL_DMM                     (0x1U << 18)
#define EDMA_SCTRL_CM                      (0x1U << 19)
#define EDMA_SCTRL_PBURST                  (0x3U << 21)
#define EDMA_SCTRL_PBURST_SINGLE           (0x0U << 21)
#define EDMA_SCTRL_PBURST_INCR4            (0x1U << 21)
#define EDMA_SCTRL_PBURST_INCR8            (0x2U << 21)
#define EDMA_SCTRL_PBURST_INCR16           (0x3U << 21)
#define EDMA_SCTRL_MBURST                  (0x3U << 23)
#define EDMA_SCTRL_MBURST_SINGLE           (0x0U << 23)
#define EDMA_SCTRL_MBURST_INCR4            (0x1U << 23)
#define EDMA_SCTRL_MBURST_INCR8            (0x2U << 23)
#define EDMA_SCTRL_MBURST_INCR16           (0x3U << 23)
#define EDMA_SCTRL_CHSEL                   (0x7U << 25)

