ninxmeow/Holy80/lib/chibios-contrib/os/common/ext/CMSIS/AT32/AT32F435_7xx/at32f435_7xx.h
} GPIO_TypeDef;

/**
  * @brief type define system config register all
  */
typedef struct
{
  /**
    * @brief scfg cfg1 register, offset:0x00
    */
  __IO uint32_t CFG1;

  /**
    * @brief scfg cfg2 register, offset:0x04
    */
  __IO uint32_t CFG2;

  /**
    * @brief scfg exintc register, offset:0x08-0x14
    */
  __IO uint32_t EXINTC[4];

  /**
    * @brief scfg reserved1 register, offset:0x18~0x28
    */
  __IO uint32_t RESERVED1[5];

  /**
    * @brief scfg uhdrv register, offset:0x2C
    */
  __IO uint32_t UHDRV;

} SCFG_TypeDef;

/**
  * @brief type define tmr register all
  */
typedef struct
{
  /**
    * @brief tmr ctrl1 register, offset:0x00
    */
  __IO uint32_t CTRL1;

  /**
    * @brief tmr ctrl2 register, offset:0x04
    */
  __IO uint32_t CTRL2;

  /**
    * @brief tmr smc register, offset:0x08
    */
  __IO uint32_t STCTRL;

  /**
    * @brief tmr die register, offset:0x0C
    */
  __IO uint32_t IDEN;

  /**
    * @brief tmr ists register, offset:0x10
    */
  __IO uint32_t ISTS;

  /**
    * @brief tmr eveg register, offset:0x14
    */
  __IO uint32_t SWEVT;

  /**
    * @brief tmr ccm1 register, offset:0x18
    */
  __IO uint32_t CM1;

  /**
    * @brief tmr ccm2 register, offset:0x1C
    */
  __IO uint32_t CM2;

  /**
    * @brief tmr cce register, offset:0x20
    */
  __IO  uint32_t CCTRL;

  /**
    * @brief tmr cnt register, offset:0x24
    */
  __IO uint32_t CVAL;

  /**
    * @brief tmr div, offset:0x28
    */
  __IO uint32_t DIV;

  /**
    * @brief tmr pr register, offset:0x2C
    */
  __IO  uint32_t PR;

  /**
    * @brief tmr rpr register, offset:0x30
    */
  __IO uint32_t RPR;

  /**
    * @brief tmr c1dt register, offset:0x34
    */
  __IO uint32_t C1DT;

  /**
    * @brief tmr c2dt register, offset:0x38
    */
  __IO uint32_t C2DT;

  /**
    * @brief tmr c3dt register, offset:0x3C
    */
  __IO uint32_t C3DT;

  /**
    * @brief tmr c4dt register, offset:0x40
    */
  __IO uint32_t C4DT;

  /**
    * @brief tmr brk register, offset:0x44
    */
  __IO uint32_t BRK;

  /**
    * @brief tmr dmactrl register, offset:0x48
    */
  __IO uint32_t DMACTRL;

  /**
    * @brief tmr dmadt register, offset:0x4C
    */
  __IO uint32_t DMADT;

  /**
    * @brief tmr rmp register, offset:0x50
    */
  __IO uint32_t RMP;

  /**
    * @brief tmr reserved1 register, offset:0x54-0x6C
    */
  __IO uint32_t RESERVED1[7];

  /**
    * @brief tmr cm3 register, offset:0x70
    */
  __IO uint32_t CM3;

  /**
    * @brief tmr c5dt register, offset:0x74
    */
  __IO uint32_t C5DT;

} TMR_TypeDef;

/**
  * @brief type define debug register all
  */
typedef struct
{
  /**
    * @brief debug idcode register, offset:0x00
    */
  __IO uint32_t IDCODE;

  /**
    * @brief debug ctrl register, offset:0x04
    */
  __IO uint32_t CTRL;

  /**
    * @brief debug apb1 frz register, offset:0x08
    */
  __IO uint32_t APB1_PAUSE;

  /**
    * @brief debug apb2 frz register, offset:0x0c
    */
  __IO uint32_t APB2_PAUSE;

} DEBUG_TypeDef;

/**
  * @brief type define dma register
  */
typedef struct
{
  /**
    * @brief dma sts register, offset:0x00
    */
  __IO uint32_t STS;

  /**
    * @brief dma clr register, offset:0x04
    */
  __IO uint32_t CLR;

  /**
    * @brief reserved, offset:0x08~0xFC
    */
  __IO uint32_t RESERVED1[62];

  /**
    * @brief dmamux sel register, offset:0x100
    */
  __IO uint32_t MUXSEL;

  /**
    * @brief reserved, offset:0x08~0xFC
    */
  __IO uint32_t RESERVED2[11];

  /**
    * @brief dmamux syncsts register, offset:0x130
    */
  __IO uint32_t MUXSYNCSTS;

  /**
    * @brief dmamux syncclr register, offset:0x134
    */
  __IO uint32_t MUXSYNCCLR;

  /**
    * @brief dmamux request generator status register, offset:0x138
    */
  __IO uint32_t MUXGSTS;

  /**
    * @brief dmamux request generator status clear register, offset:0x13C
    */
  __IO uint32_t MUXGCLR;

} DMA_TypeDef;

/**
  * @brief type define dma channel register all
  */
typedef struct
{
  /**
    * @brief dma ctrl register, offset:0x08+20*(x-1) x=1...7
    */
  __IO uint32_t CTRL;

  /**
    * @brief dma dtcnt register, offset:0x0C+20*(x-1) x=1...7
    */
  __IO uint32_t DTCNT;

  /**
    * @brief dma cpba register, offset:0x10+20*(x-1) x=1...7
    */
  __IO uint32_t PADDR;

  /**
    * @brief dma cmba register, offset:0x14+20*(x-1) x=1...7
    */
  __IO uint32_t MADDR;
} DMA_Channel_TypeDef;

/**
  * @brief type define dmamux muxsctrl register
  */
typedef struct
{
  /**
    * @brief dma muxsctrl register
    */
  __IO uint32_t MUXCTRL;

} DMAMUX_Channel_TypeDef;

/**
  * @brief type define dmamux request generator register all
  */
typedef struct
{
  /**
    * @brief dmamux request generator register, offset:0x120+4*(x-1) x=1...4
    */
  __IO uint32_t GCTRL;

} DMAMUX_Generator_TypeDef;

/**
  * @brief type define edma register
  */
typedef struct
{
  /**
    * @brief edma sts1 register, offset:0x00
    */
  __IO uint32_t STS1;

  /**
    * @brief edma sts2 register, offset:0x04
    */
  __IO uint32_t STS2;

  /**
    * @brief edma clr1 register, offset:0x08
    */
  __IO uint32_t CLR1;

  /**
    * @brief edma clr2 register, offset:0x0C
    */
  __IO uint32_t CLR2;

  /**
    * @brief reserved, offset:0x10~0xCC
    */
  __IO uint32_t RESERVED1[48];

  /**
    * @brief edma link list ctrl register, offset:0xD0
    */
  __IO uint32_t LLCTRL;

  /**
    * @brief reserved, offset:0xD4~0xF0
    */
  __IO uint32_t RESERVED2[8];

  /**
    * @brief edma 2d ctrl register, offset:0xF4
    */
  __IO uint32_t S2DCTRL;

  /**
    * @brief reserved, offset:0xF8~0x138
    */
  __IO uint32_t RESERVED3[17];

  /**
    * @brief edmamux sel register, offset:0x13C
    */
  __IO uint32_t MUXSEL;

  /**
    * @brief reserved, offset:0x140~0x16C
    */
  __IO uint32_t RESERVED4[12];

  /**
    * @brief edmamux syncsts register, offset:0x170
    */
  __IO uint32_t MUXSYNCSTS;

  /**
    * @brief edmamux syncclr register, offset:0x174
    */
  __IO uint32_t MUXSYNCCLR;

  /**
    * @brief edmamux request generator status register, offset:0x178
    */
  __IO uint32_t MUXGSTS;

  /**
    * @brief edmamux request generator status clear register, offset:0x17C
    */
  __IO uint32_t MUXGCLR;

} EDMA_TypeDef;

/**
  * @brief type define edma channel register all
  */
typedef struct
{
  /**
    * @brief edma sxctrl register, offset:0x10+0x18*n n=1...8
    */
  __IO uint32_t CTRL;

  /**
    * @brief edma dtcnt register, offset:0x14+0x18*n n=1...8
    */
  __IO uint32_t DTCNT;

  /**
    * @brief edma paddr register, offset:0x18+0x18*n n=1...8
    */
  __IO uint32_t PADDR;

  /**
    * @brief edma m0adr register, offset:0x1C+0x18*n n=1...8
    */
  __IO uint32_t M0ADDR;

  /**
    * @brief edma m1adr register, offset:0x20+0x18*n n=1...8
    */
  __IO uint32_t M1ADDR;

  /**
    * @brief edma fctrl register, offset:0x24+0x18*n n=1...8
    */
  __IO uint32_t FCTRL;
  
} EDMA_Stream_TypeDef;

/**
  * @brief type define edma stream link list pointer register
  */
typedef struct
{
  /**
    * @brief edma stream link list pointer register
    */
  __IO uint32_t LLP;

} EDMA_Stream_Link_List_TypeDef;

/**
  * @brief type define edma 2d register all
  */
typedef struct
{
  /**
    * @brief edma s2dcnt register, offset:0x00
    */
  __IO uint32_t S2DCNT;

  /**
    * @brief edma stride register, offset:0x04
    */
  __IO uint32_t STRIDE;
 
