ninxmeow/Holy80/lib/chibios-contrib/os/common/ext/CMSIS/AT32/AT32F435_7xx/at32f435_7xx.h
} EDMA_Stream_2D_TypeDef;

/**
  * @brief type define edmamux muxsctrl register
  */
typedef struct
{
  /**
    * @brief edma muxsctrl register
    */
  __IO uint32_t MUXCTRL;

} EDMAMUX_Channel_TypeDef;

/**
  * @brief type define edmaamux request generator register all
  */
typedef struct
{
  /**
    * @brief edmaamux request generator register, offset:0x120+4*(x-1) x=1...4
    */
  __IO uint32_t GCTRL;

} EDMAMUX_Generator_TypeDef;

/**
  * @brief type define adc register all
  */
typedef struct
{
  /**
    * @brief adc sts register, offset:0x00
    */
  __IO uint32_t STS;

  /**
    * @brief adc ctrl1 register, offset:0x04
    */  
   __IO uint32_t CTRL1;

  /**
    * @brief adc ctrl2 register, offset:0x08
    */
  __IO uint32_t CTRL2;

  /**
    * @brief adc spt1 register, offset:0x0C
    */
  __IO uint32_t SPT1;

  /**
    * @brief adc spt2 register, offset:0x10
    */
  __IO uint32_t SPT2;

  /**
    * @brief adc pcdto1 register, offset:0x14
    */
  __IO uint32_t PCDTO1;

  /**
    * @brief adc pcdto2 register, offset:0x18
    */
  __IO uint32_t PCDTO2;

  /**
    * @brief adc pcdto3 register, offset:0x1C
    */
  __IO uint32_t PCDTO3;

  /**
    * @brief adc pcdto4 register, offset:0x20
    */
  __IO uint32_t PCDTO4;

  /**
    * @brief adc vmhb register, offset:0x24
    */
  __IO uint32_t VMHB;

  /**
    * @brief adc vmlb register, offset:0x28
    */
  __IO uint32_t VMLB;

  /**
    * @brief adc osq1 register, offset:0x2C
    */
  __IO uint32_t OSQ1;

  /**
    * @brief adc osq2 register, offset:0x30
    */
  __IO uint32_t OSQ2;

  /**
    * @brief adc osq3 register, offset:0x34
    */
  __IO uint32_t OSQ3;

  /**
    * @brief adc psq register, offset:0x38
    */
  __IO uint32_t PSQ;

  /**
    * @brief adc pdt1 register, offset:0x3C
    */
  __IO uint32_t PDT1;

  /**
    * @brief adc pdt2 register, offset:0x40
    */
  __IO uint32_t PDT2;

  /**
    * @brief adc pdt3 register, offset:0x44
    */
  __IO uint32_t PDT3;

  /**
    * @brief adc pdt4 register, offset:0x48
    */
  __IO uint32_t PDT4;

  /**
    * @brief adc odt register, offset:0x4C
    */
  __IO uint32_t ODT;

  /**
    * @brief adc reserved1 register, offset:0x50~0x7C
    */
  __IO uint32_t RESERVED1[12];

  /**
    * @brief adc oversample register, offset:0x80 
    */
  __IO uint32_t OVSP;

  /**
    * @brief adc reserved2 register, offset:0x80~0xB0
    */
  __IO uint32_t RESERVED2[12];

  /**
    * @brief adc calval register, offset:0xB4
    */
  __IO uint32_t CALVAL;

} ADC_TypeDef;

/**
  * @brief type define adc register all
  */
typedef struct
{
  /**
    * @brief adc csts register, offset:0x00
    */
  __IO uint32_t CSTS;
  
  /**
    * @brief adc cctrl register, offset:0x04
    */
  __IO uint32_t CCTRL;

  /**
    * @brief adc codt register, offset:0x08
    */
  __IO uint32_t CODT;

} ADCCOM_TypeDef;

/**
  * @brief type define i2c register all
  */
typedef struct
{
  /**
    * @brief i2c ctrl1 register, offset:0x00
    */
  __IO uint32_t CTRL1;

  /**
    * @brief i2c ctrl2 register, offset:0x04
    */
  __IO uint32_t CTRL2;

  /**
    * @brief i2c oaddr1 register, offset:0x08
    */
  __IO uint32_t OADDR1;

  /**
    * @brief i2c oaddr2 register, offset:0x0C
    */
  __IO uint32_t OADDR2;

  /**
    * @brief i2c clkctrl register, offset:0x10
    */
  __IO uint32_t CLKCTRL;

  /**
    * @brief i2c timeout register, offset:0x14
    */
  __IO uint32_t TIMEOUT;

  /**
    * @brief i2c sts register, offset:0x18
    */
  __IO uint32_t STS;

  /**
    * @brief i2c clr register, offset:0x1C
    */
  __IO uint32_t CLR;

  /**
    * @brief i2c pec register, offset:0x20
    */
  __IO uint32_t PEC;

  /**
    * @brief i2c rxdt register, offset:0x20
    */
  __IO uint32_t RXDT;

  /**
    * @brief i2c txdt register, offset:0x20
    */
  __IO uint32_t TXDT;

} I2C_TypeDef;

/**
  * @brief type define usart register all
  */
typedef struct
{
  /**
    * @brief usart sts register, offset:0x00
    */
  __IO uint32_t STS;

  /**
    * @brief usart dt register, offset:0x04
    */
  __IO uint32_t DT;

  /**
    * @brief usart baudr register, offset:0x08
    */
  __IO uint32_t BAUDR;

  /**
    * @brief usart ctrl1 register, offset:0x0C
    */
  __IO uint32_t CTRL1;

  /**
    * @brief usart ctrl2 register, offset:0x10
    */
  __IO uint32_t CTRL2;

  /**
    * @brief usart ctrl3 register, offset:0x14
    */
  __IO uint32_t CTRL3;

  /**
    * @brief usart gdiv register, offset:0x18
    */
  __IO uint32_t GDIV;

} USART_TypeDef;

/**
  * @brief type define spi register all
  */
typedef struct
{

  /**
    * @brief spi ctrl1 register, offset:0x00
    */
  __IO uint32_t CTRL1;

  /**
    * @brief spi ctrl2 register, offset:0x04
    */
  __IO uint32_t CTRL2;

  /**
    * @brief spi sts register, offset:0x08
    */
  __IO uint32_t STS;

  /**
    * @brief spi dt register, offset:0x0C
    */
  __IO uint32_t DT;

  /**
    * @brief spi cpoly register, offset:0x10
    */
  __IO uint32_t CPOLY;

  /**
    * @brief spi rcrc register, offset:0x14
    */
  __IO uint32_t RCRC;
  /**
    * @brief spi tcrc register, offset:0x18
    */
  __IO uint32_t TCRC;

  /**
    * @brief spi i2sctrl register, offset:0x1C
    */
  __IO uint32_t I2SCTRL;

  /**
    * @brief spi i2sclk register, offset:0x20
    */
  __IO uint32_t I2SCLK;

} SPI_TypeDef;

/**
  * @}
  */

/** @addtogroup Peripheral_instance
  * @{
  */

#define EXINT                             ((EXINT_TypeDef *) EXINT_BASE)
#define CRM                               ((CRM_TypeDef *) CRM_BASE)
#define PWC                               ((PWC_TypeDef *) PWC_BASE)
#define FLASH                             ((FLASH_TypeDef *) FLASH_REG_BASE)
#define GPIOA                             ((GPIO_TypeDef *) GPIOA_BASE)
#define GPIOB                             ((GPIO_TypeDef *) GPIOB_BASE)
#define GPIOC                             ((GPIO_TypeDef *) GPIOC_BASE)
#define GPIOD                             ((GPIO_TypeDef *) GPIOD_BASE)
#define GPIOE                             ((GPIO_TypeDef *) GPIOE_BASE)
#define GPIOF                             ((GPIO_TypeDef *) GPIOF_BASE)
#define GPIOG                             ((GPIO_TypeDef *) GPIOG_BASE)
#define GPIOH                             ((GPIO_TypeDef *) GPIOH_BASE)
#define SCFG                              ((SCFG_TypeDef *) SCFG_BASE)
#define TMR1                              ((TMR_TypeDef *) TMR1_BASE)
#define TMR2                              ((TMR_TypeDef *) TMR2_BASE)
#define TMR3                              ((TMR_TypeDef *) TMR3_BASE)
#define TMR4                              ((TMR_TypeDef *) TMR4_BASE)
#define TMR5                              ((TMR_TypeDef *) TMR5_BASE)
#define TMR6                              ((TMR_TypeDef *) TMR6_BASE)
#define TMR7                              ((TMR_TypeDef *) TMR7_BASE)
#define TMR8                              ((TMR_TypeDef *) TMR8_BASE)
#define TMR9                              ((TMR_TypeDef *) TMR9_BASE)
#define TMR10                             ((TMR_TypeDef *) TMR10_BASE)
#define TMR11                             ((TMR_TypeDef *) TMR11_BASE)
#define TMR12                             ((TMR_TypeDef *) TMR12_BASE)
#define TMR13                             ((TMR_TypeDef *) TMR13_BASE)
#define TMR14                             ((TMR_TypeDef *) TMR14_BASE)
#define TMR20                             ((TMR_TypeDef *) TMR20_BASE)
#define DEBUGMCU                          ((DEBUG_TypeDef *) DEBUG_BASE)
#define DMA1                              ((DMA_TypeDef *) DMA1_BASE)
#define DMA2                              ((DMA_TypeDef *) DMA2_BASE)
#define DMA1_CHANNEL1                     ((DMA_Channel_TypeDef *) DMA1_CHANNEL1_BASE)
#define DMA1_CHANNEL2                     ((DMA_Channel_TypeDef *) DMA1_CHANNEL2_BASE)
#define DMA1_CHANNEL3                     ((DMA_Channel_TypeDef *) DMA1_CHANNEL3_BASE)
#define DMA1_CHANNEL4                     ((DMA_Channel_TypeDef *) DMA1_CHANNEL4_BASE)
#define DMA1_CHANNEL5                     ((DMA_Channel_TypeDef *) DMA1_CHANNEL5_BASE)
#define DMA1_CHANNEL6                     ((DMA_Channel_TypeDef *) DMA1_CHANNEL6_BASE)
#define DMA1_CHANNEL7                     ((DMA_Channel_TypeDef *) DMA1_CHANNEL7_BASE)
#define DMA2_CHANNEL1                     ((DMA_Channel_TypeDef *) DMA2_CHANNEL1_BASE)
#define DMA2_CHANNEL2                     ((DMA_Channel_TypeDef *) DMA2_CHANNEL2_BASE)
#define DMA2_CHANNEL3                     ((DMA_Channel_TypeDef *) DMA2_CHANNEL3_BASE)
#define DMA2_CHANNEL4                     ((DMA_Channel_TypeDef *) DMA2_CHANNEL4_BASE)
#define DMA2_CHANNEL5                     ((DMA_Channel_TypeDef *) DMA2_CHANNEL5_BASE)
#define DMA2_CHANNEL6                     ((DMA_Channel_TypeDef *) DMA2_CHANNEL6_BASE)
#define DMA2_CHANNEL7                     ((DMA_Channel_TypeDef *) DMA2_CHANNEL7_BASE)
#define DMA1MUX_CHANNEL1                  ((DMAMUX_Channel_TypeDef *) DMA1MUX_CHANNEL1_BASE)
#define DMA1MUX_CHANNEL2                  ((DMAMUX_Channel_TypeDef *) DMA1MUX_CHANNEL2_BASE)
#define DMA1MUX_CHANNEL3                  ((DMAMUX_Channel_TypeDef *) DMA1MUX_CHANNEL3_BASE)
#define DMA1MUX_CHANNEL4                  ((DMAMUX_Channel_TypeDef *) DMA1MUX_CHANNEL4_BASE)
#define DMA1MUX_CHANNEL5                  ((DMAMUX_Channel_TypeDef *) DMA1MUX_CHANNEL5_BASE)
#define DMA1MUX_CHANNEL6                  ((DMAMUX_Channel_TypeDef *) DMA1MUX_CHANNEL6_BASE)
#define DMA1MUX_CHANNEL7                  ((DMAMUX_Channel_TypeDef *) DMA1MUX_CHANNEL7_BASE)
#define DMA2MUX_CHANNEL1                  ((DMAMUX_Channel_TypeDef *) DMA2MUX_CHANNEL1_BASE)
#define DMA2MUX_CHANNEL2                  ((DMAMUX_Channel_TypeDef *) DMA2MUX_CHANNEL2_BASE)
#define DMA2MUX_CHANNEL3                  ((DMAMUX_Channel_TypeDef *) DMA2MUX_CHANNEL3_BASE)
#define DMA2MUX_CHANNEL4                  ((DMAMUX_Channel_TypeDef *) DMA2MUX_CHANNEL4_BASE)
#define DMA2MUX_CHANNEL5                  ((DMAMUX_Channel_TypeDef *) DMA2MUX_CHANNEL5_BASE)
#define DMA2MUX_CHANNEL6                  ((DMAMUX_Channel_TypeDef *) DMA2MUX_CHANNEL6_BASE)
#define DMA2MUX_CHANNEL7                  ((DMAMUX_Channel_TypeDef *) DMA2MUX_CHANNEL7_BASE)
#define DMA1MUX_GENERATOR1                ((DMAMUX_Generator_TypeDef *) DMA1MUX_GENERATOR1_BASE)
#define DMA1MUX_GENERATOR2                ((DMAMUX_Generator_TypeDef *) DMA1MUX_GENERATOR2_BASE)
#define DMA1MUX_GENERATOR3                ((DMAMUX_Generator_TypeDef *) DMA1MUX_GENERATOR3_BASE)
#define DMA1MUX_GENERATOR4                ((DMAMUX_Generator_TypeDef *) DMA1MUX_GENERATOR4_BASE)
#define DMA2MUX_GENERATOR1                ((DMAMUX_Generator_TypeDef *) DMA2MUX_GENERATOR1_BASE)
#define DMA2MUX_GENERATOR2                ((DMAMUX_Generator_TypeDef *) DMA2MUX_GENERATOR2_BASE)
#define DMA2MUX_GENERATOR3                ((DMAMUX_Generator_TypeDef *) DMA2MUX_GENERATOR3_BASE)
#define DMA2MUX_GENERATOR4                ((DMAMUX_Generator_TypeDef *) DMA2MUX_GENERATOR4_BASE)
#define EDMA1                             ((EDMA_TypeDef *) EDMA_BASE)
#define EDMA1_STREAM1                     ((EDMA_Stream_TypeDef *) EDMA_STREAM1_BASE)
#define EDMA1_STREAM2                     ((EDMA_Stream_TypeDef *) EDMA_STREAM2_BASE)
#define EDMA1_STREAM3                     ((EDMA_Stream_TypeDef *) EDMA_STREAM3_BASE)
#define EDMA1_STREAM4                     ((EDMA_Stream_TypeDef *) EDMA_STREAM4_BASE)
#define EDMA1_STREAM5                     ((EDMA_Stream_TypeDef *) EDMA_STREAM5_BASE)
#define EDMA1_STREAM6                     ((EDMA_Stream_TypeDef *) EDMA_STREAM6_BASE)
#define EDMA1_STREAM7                     ((EDMA_Stream_TypeDef *) EDMA_STREAM7_BASE)
#define EDMA1_STREAM8                     ((EDMA_Stream_TypeDef *) EDMA_STREAM8_BASE)
#define EDMA1_STREAM1_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM1_2D_BASE)
#define EDMA1_STREAM2_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM2_2D_BASE)
#define EDMA1_STREAM3_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM3_2D_BASE)
#define EDMA1_STREAM4_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM4_2D_BASE)
#define EDMA1_STREAM5_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM5_2D_BASE)
#define EDMA1_STREAM6_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM6_2D_BASE)
#define EDMA1_STREAM7_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM7_2D_BASE)
#define EDMA1_STREAM8_2D                  ((EDMA_Stream_2D_TypeDef *) EDMA_STREAM8_2D_BASE)
#define EDMA1_STREAM1_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM1_LL_BASE)
#define EDMA1_STREAM2_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM2_LL_BASE)
#define EDMA1_STREAM3_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM3_LL_BASE)
#define EDMA1_STREAM4_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM4_LL_BASE)
#define EDMA1_STREAM5_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM5_LL_BASE)
#define EDMA1_STREAM6_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM6_LL_BASE)
#define EDMA1_STREAM7_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM7_LL_BASE)
#define EDMA1_STREAM8_LL                  ((EDMA_Stream_Link_List_TypeDef *) EDMA_STREAM8_LL_BASE)
#define EDMA1MUX_CHANNEL1                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL1_BASE)
#define EDMA1MUX_CHANNEL2                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL2_BASE)
#define EDMA1MUX_CHANNEL3                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL3_BASE)
#define EDMA1MUX_CHANNEL4                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL4_BASE)
#define EDMA1MUX_CHANNEL5                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL5_BASE)
#define EDMA1MUX_CHANNEL6                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL6_BASE)
#define EDMA1MUX_CHANNEL7                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL7_BASE)
#define EDMA1MUX_CHANNEL8                 ((EDMAMUX_Channel_TypeDef *) EDMAMUX_CHANNEL8_BASE)
#define EDMA1MUX_GENERATOR1               ((EDMAMUX_Generator_TypeDef *) EDMAMUX_GENERATOR1_BASE)
#define EDMA1MUX_GENERATOR2               ((EDMAMUX_Generator_TypeDef *) EDMAMUX_GENERATOR2_BASE)
#define EDMA1MUX_GENERATOR3               ((EDMAMUX_Generator_TypeDef *) EDMAMUX_GENERATOR3_BASE)
#define EDMA1MUX_GENERATOR4               ((EDMAMUX_Generator_TypeDef *) EDMAMUX_GENERATOR4_BASE)
#define ADC1                              ((ADC_TypeDef *) ADC1_BASE)
#define ADC2                              ((ADC_TypeDef *) ADC2_BASE)
#define ADC3                              ((ADC_TypeDef *) ADC3_BASE)
#define ADCCOM                            ((ADCCOM_TypeDef *) ADCCOM_BASE)
#define I2C1                              ((I2C_TypeDef *) I2C1_BASE)
#define I2C2                              ((I2C_TypeDef *) I2C2_BASE)
#define I2C3                              ((I2C_TypeDef *) I2C3_BASE)
#define USART1                            ((USART_TypeDef *) USART1_BASE)
#define USART2                            ((USART_TypeDef *) USART2_BASE)
#define USART3                            ((USART_TypeDef *) USART3_BASE)
#define UART4                             ((USART_TypeDef *) UART4_BASE)
#define UART5                             ((USART_TypeDef *) UART5_BASE)
#define USART6                            ((USART_TypeDef *) USART6_BASE)
#define UART7                             ((USART_TypeDef *) UART7_BASE)
#define UART8                             ((USART_TypeDef *) UART8_BASE)
#define SPI1                              ((SPI_TypeDef *) SPI1_BASE)
#define SPI2                              ((SPI_TypeDef *) SPI2_BASE)
#define SPI3                              ((SPI_TypeDef *) SPI3_BASE)
#define SPI4                              ((SPI_TypeDef *) SPI4_BASE)
#define I2S2EXT                           ((SPI_TypeDef *) I2S2EXT_BASE)
#define I2S3EXT                           ((SPI_TypeDef *) I2S3EXT_BASE)

/**
  * @}
  */

/** @defgroup FLASH_unlock_keys
  * @brief flash unlock keys
  * @{
  */
 
#define FLASH_UNLOCK_KEY1                ((uint32_t)0x45670123) /*!< flash operation unlock order key1 */
#define FLASH_UNLOCK_KEY2                ((uint32_t)0xCDEF89AB) /*!< flash operation unlock order key2 */
#define FAP_RELIEVE_KEY                  ((uint16_t)0x00A5)     /*!< flash fap relieve key val */
#define SLIB_UNLOCK_KEY                  ((uint32_t)0xA35F6D24) /*!< flash slib operation unlock order key */

#if defined (AT32F435CMU7) || defined (AT32F435CMT7) || defined (AT32F435RMT7) || \
    defined (AT32F435VMT7) || defined (AT32F435ZMT7) || defined (AT32F437RMT7) || \
    defined (AT32F437VMT7) || defined (AT32F437ZMT7)
#define FLASH_BANK1_START_ADDR           ((uint32_t)0x08000000) /*!< flash start address of bank1 */
#define FLASH_BANK1_END_ADDR             ((uint32_t)0x081FFFFF) /*!< flash end address of bank1 */
#define FLASH_BANK2_START_ADDR           ((uint32_t)0x08200000) /*!< flash start address of bank2 */
#define FLASH_BANK2_END_ADDR             ((uint32_t)0x083EFFFF) /*!< flash end address of bank2 */
#else
#define FLASH_BANK1_START_ADDR           ((uint32_t)0x08000000) /*!< flash start address of bank1 */
#define FLASH_BANK1_END_ADDR             ((uint32_t)0x0807FFFF) /*!< flash end address of bank1 */
#define FLASH_BANK2_START_ADDR           ((uint32_t)0x08080000) /*!< flash start address of bank2 */
#define FLASH_BANK2_END_ADDR             ((uint32_t)0x080FFFFF) /*!< flash end address of bank2 */
#endif

#define FLASHSIZE_BASE                   ((uint32_t)0x1FFFF7E0U) /*!< FLASH Size register base address */
#define UID_BASE                         ((uint32_t)0x1FFFF7E8U) /*!< Unique device ID register base address */

/**
  * @}
  */
 
#ifdef __cplusplus
}
#endif

#endif
